<template><div><h2 id="密码学基础" tabindex="-1"><a class="header-anchor" href="#密码学基础"><span>密码学基础</span></a></h2>
<ul>
<li>密码学是研究如何隐秘地传递信息的学科，其首要目的是隐藏信息的涵义 密码算法的保密 --&gt;  密码算法公开、密钥保密（基于<strong>计算复杂性</strong>）
<ul>
<li>密码学 Cryptology：研究信息系统安全保密的科学</li>
<li>密码编码学 Cryptography：研究对信息进行编码，实现对信息的隐藏</li>
<li>密码分析学 Cryptanalytics：加密消息的破译或消息伪造</li>
</ul>
</li>
<li>明文 P（消息 M） --&gt;  加密   --&gt;  密文 C  --&gt; 解密   --&gt;  原始明文
<ul>
<li>E(M) = C</li>
<li>D(C) = M</li>
<li>D(E(M)) = M</li>
</ul>
</li>
<li>对称密码（传统密码算法），加密密钥可以从解密秘钥中推算出来，安全性依赖于密钥的保密
<ul>
<li>分组密码算法：以明文的一组位为单位进行加、解密，如 DES、DES3、IDEA、AES 等</li>
<li>序列密码（流密码）算法：以明文的一位（一字节）为单位进行计算，如 RC4、A5、SEAL、PIKE 等</li>
</ul>
</li>
<li>非对称密码（公开密钥算法），加密密钥和解密密钥不同，且在可计算时间内无法根据加密密钥计算出解密密钥</li>
<li>密码协议：也称为安全协议，以密码学为基础的消息交换协议 认证协议、不可否认协议、公平性协议、身份识别协议、密钥管理协议</li>
<li>安全编码原则：密码算法应建立在算法的公开不影响明文和密钥安全前提下</li>
<li>DES、RSA、MD5、PGP</li>
</ul>
</div></template>


