<template><div><ul>
<li>流密码：每次加密数据流的一位或者一个字节。密文不仅与最初给定的算法和密钥有关，同时也与明文位置有关。</li>
<li>分组密码：将一个明文分组作为整体加密并且通常得到的是与明文等长的密文分组。密文仅与给定的密码算法和密钥有关，与被处理的明文数据在整个明文中的位置无关。</li>
<li>乘积密码：依次使用两个或两个以上的基本密码，所得结果的密码强度将强于所有单个密码的强
<ul>
<li>Substitution-Permutation Networks：代替（每个明文元素或元素组被唯一地替换为相应的密文元素或元素组）、置换（明文元素的序列被替换为该序列的一个置换）</li>
<li>confusion &amp; diffusion：扰乱/混淆（使密文和加密密钥之间的关系尽量复杂）、扩散（明文统计结构扩散消失到大批密文统计特性中，使明文和密文之间的统计关系尽量复杂）</li>
</ul>
</li>
<li>Feistel 密码结构：分组长度、密钥长度、迭代轮数、子密钥产生算法、轮函数</li>
<li>差分密码攻击：关注一对明文在加密过程中通过轮函数的演变情况</li>
</ul>
</div></template>


